cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <HTTPUpdate.h>
#include <WiFiClientSecure.h>
#include <esp_task_wdt.h>      // Untuk Task Watchdog Timer
#include <Preferences.h>
#include <SPI.h>
#include <MFRC522.h>
#include <Update.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>       // Library untuk parsing JSON
#include <time.h>              // Untuk timestamp
#include "soc/soc.h"           // Untuk kontrol Brownout
#include "soc/rtc_cntl_reg.h"  // Untuk kontrol Brownout

// ========================================================================
// 1. ZONA KONFIGURASI UTAMA
// ========================================================================

#define APP_VERSION         "3.2"               // Versi Firmware ESP32 WiFi
#define GITHUB_USER         "cloudrisenx"       // Username GitHub
#define GITHUB_REPO         "wanaraseta_gate"   // Nama Repository

#define DEFAULT_AP_SSID     "Wanara_Gate_Setup" 
#define DEFAULT_AP_PASSWORD "griyapersada"

#define RELAY1_PIN          2                   // Relay 1 (Gate In) / Built-in LED
#define RELAY2_PIN          27                  // Relay 2 (Gate Out / Alarm)
#define GATE_OPEN_MS        200                 // Durasi gerbang terbuka (200 ms)

// Konfigurasi Level Logika Relay (Active-LOW)
#define RELAY_ACTIVE        LOW
#define RELAY_DEACTIVE      HIGH

// Konfigurasi Watchdog Timer
#define WDT_TIMEOUT_SECONDS 5                   // Timeout WDT 5 detik

// Konfigurasi Barcode Scanner (UART2 default ESP32)
#define BARCODE_RX          16                  // RX2 (default ESP32)
#define BARCODE_TX          17                  // TX2 (default ESP32)
#define BARCODE_BAUD        9600

// Konfigurasi Pin SPI & RFID MFRC522 (VSPI default ESP32)
#define SS_PIN              5                   // VSPI SS
#define RST_PIN             22                  // RFID RST Pin
#define SPI_SCK             18                  // VSPI SCK
#define SPI_MISO            19                  // VSPI MISO
#define SPI_MOSI            23                  // VSPI MOSI

// Cooldown Pembacaan RFID (Milidetik)
#define COOLDOWN_SAME_CARD_MS 3000              // Cooldown untuk kartu yang sama
#define COOLDOWN_ANY_CARD_MS  500               // Cooldown minimal antar scan kartu apa saja

// ========================================================================
// 2. VARIABEL GLOBAL & INSTANSIASI
// ========================================================================

WebServer server(80);
WiFiManager wm;
Preferences preferences;

MFRC522 mfrc522(SS_PIN, RST_PIN);
WiFiClient espClient;
PubSubClient mqttClient(espClient);

// Konfigurasi MQTT Default (Akan ditimpa oleh preferensi yang tersimpan)
String mqtt_server     = "127.0.0.1";
int    mqtt_port       = 1883;
String mqtt_user       = "gate_esp32_01";
String mqtt_pass       = "11223344";
String mqtt_client_id  = "gate_esp32_01";

String folderAktif     = "ESP32main";
String savedApSSID     = DEFAULT_AP_SSID;

// Penundaan restart untuk respon HTTP bersih
bool pendingRestart = false;
unsigned long restartTime = 0;

String rfidStatus      = "Mencari Sensor...";
String lastRfidScan    = "";
String lastBarcodeScan = "";
String rfid_master     = "A166C820";
String lastScannedUid  = "";
unsigned long lastScannedTime = 0;

// Status & Timer Relay
unsigned long relay1ActiveTime = 0;
bool isRelay1Active = false;
unsigned long relay2ActiveTime = 0;
bool isRelay2Active = false;

unsigned long lastMqttReconnectAttempt = 0;

// Forward Declarations untuk menghindari error undeclared scope
void prepareForOTA();
void restoreAfterOTA();
void cekUpdateGitHub(bool fromWeb = false);
void triggerRelay(int relayNum);
void handleGate();
void reinitRFID();

// ========================================================================
// KONTROL RESET & RE-INISIALISASI RFID
// ========================================================================
void reinitRFID() {
  Serial.println("[RFID] Re-inisialisasi sensor RFID...");
  
  // Hardware Reset Pulsa via RST Pin
  pinMode(RST_PIN, OUTPUT);
  digitalWrite(RST_PIN, LOW);
  delay(10);
  digitalWrite(RST_PIN, HIGH);
  delay(50);

  mfrc522.PCD_Init();
  mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
  delay(10);
}

// ========================================================================
// 3. KONTROL POWER-SAVING & ANTI-BROWNOUT
// ========================================================================
void prepareForOTA() {
  Serial.println("[OTA] Menyiapkan sistem untuk update (Mode Hemat Daya & Anti-Brownout)...");
  
  // 1. Matikan relay agar tidak membebani daya
  digitalWrite(RELAY1_PIN, RELAY_DEACTIVE);
  digitalWrite(RELAY2_PIN, RELAY_DEACTIVE);
  isRelay1Active = false;
  isRelay2Active = false;
  
  // 2. Putuskan MQTT dan bersihkan koneksi socket untuk membebaskan RAM
  if (mqttClient.connected()) {
    mqttClient.disconnect();
  }
  espClient.stop();
  delay(100);
  
  // 3. Matikan antena RFID untuk memotong konsumsi arus
  mfrc522.PCD_AntennaOff();
  delay(50);
  
  // 4. Nonaktifkan detektor Brownout secara software
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
  delay(50);
  
  // 5. Nonaktifkan Watchdog Timer (WDT) agar tidak reset saat flashing
  esp_task_wdt_delete(NULL); 
  yield();
}

void restoreAfterOTA() {
  Serial.println("[OTA] Mengembalikan konfigurasi daya & WDT...");
  
  // 1. Aktifkan kembali detektor Brownout
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 1);
  delay(10);
  
  // 2. Aktifkan kembali Watchdog Timer (WDT)
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  esp_task_wdt_add(NULL);
  
  // 3. Inisialisasi ulang SPI & RFID
  SPI.end();
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI, SS_PIN);
  mfrc522.PCD_Init();
  delay(10);
  mfrc522.PCD_AntennaOn();
}

// ========================================================================
// 4. OTA UPDATE GITHUB (HTTPS DENGAN OPTIMASI MEMORI)
// ========================================================================
void cekUpdateGitHub(bool fromWeb) {
  auto logMsg = [&](String msg) {
    Serial.print(msg);
    if (fromWeb) server.sendContent(msg);
  };

  logMsg("[OTA] Memeriksa update di cabang GitHub: main\n");
  String folderPath = folderAktif;
  String urlVersi = String("https://raw.githubusercontent.com/") + GITHUB_USER + "/" + GITHUB_REPO + "/main/wanaraseta_gate/" + folderPath + "/version.txt";
  String urlFirmware = String("https://raw.githubusercontent.com/") + GITHUB_USER + "/" + GITHUB_REPO + "/main/wanaraseta_gate/" + folderPath + "/firmware.bin";

  bool doUpdate = false;
  String versiDiGitHub = "";

  // Step 1: Cek Versi (Gunakan scope agar memory client secure dibebaskan setelah cek)
  {
    WiFiClientSecure client;
    client.setInsecure(); // Bypass SSL verification untuk menghemat RAM

    HTTPClient http;
    http.begin(client, urlVersi);
    int httpCode = http.GET();

    if (httpCode == HTTP_CODE_OK) {
      versiDiGitHub = http.getString();
      versiDiGitHub.trim();

