cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
    .overlay {
      position: fixed;
      top: 0; left: 0; width: 100%; height: 100%;
      background: rgba(11, 12, 17, 0.96);
      z-index: 9999;
      display: flex; flex-direction: column; justify-content: center; align-items: center;
      display: none;
    }
    .spinner {
      width: 44px; height: 44px;
      border: 3px solid rgba(255, 255, 255, 0.08);
      border-top: 3px solid var(--primary);
      border-radius: 50%;
      animation: spin 1s linear infinite;
      margin-bottom: 16px;
    }
    @keyframes spin { 0% { transform: rotate(0deg); } 100% { transform: rotate(360deg); } }
    .overlay h2 { margin: 0 0 6px 0; font-size: 18px; font-weight: 600; }
    .overlay p { margin: 0; color: var(--text-muted); font-size: 13px; }
    
    .toast {
      position: fixed;
      bottom: 20px; right: 20px;
      background: rgba(22, 25, 41, 0.96);
      border: 1px solid var(--success);
      border-radius: 8px;
      padding: 10px 20px;
      color: #ffffff;
      box-shadow: 0 8px 24px rgba(0,0,0,0.5);
      display: flex; align-items: center; gap: 8px;
      transform: translateY(100px); opacity: 0;
      transition: transform 0.3s, opacity 0.3s;
      font-size: 13px;
      z-index: 999;
    }
    .toast.show { transform: translateY(0); opacity: 1; }
  </style>
</head>
<body>
  <div class="app-container">
    <header>
      <div class="brand">
        <h1>🏢 Wanara Seta Gate Portal</h1>
        <p>Sistem Gate Controller ESP32 S4 38-Pin</p>
      </div>
      <div class="badge-group">
        <span class="badge badge-primary">Firmware v<span id="version-text">{{VERSION}}</span></span>
        <span class="badge" id="folder-badge">{{FOLDER}}</span>
      </div>
    </header>

    <div class="grid">
      <!-- Card Status Hardware & Sistem -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M9 3v2m6-2v2M9 19v2m6-2v2M5 9H3m2 6H3m18-6h-2m2 6h-2M7 19h10a2 2 0 002-2V7a2 2 0 00-2-2H7a2 2 0 00-2 2v10a2 2 0 002 2zM9 9h6v6H9V9z"></path></svg>
          Status Hardware & Sistem
        </h3>
        <div class="status-list">
          <div class="status-item">
            <span class="status-label">Uptime</span>
            <span class="status-value mono" id="uptime">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">Free Heap RAM</span>
            <span class="status-value mono" id="free-heap">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">Min Free Heap</span>
            <span class="status-value mono" id="min-free-heap">Loading...</span>
          </div>
          <div class="status-item" style="margin-top: 6px;">
            <button class="btn btn-secondary btn-danger" onclick="rebootDevice()">
              <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" style="width:14px;height:14px;"><path stroke-linecap="round" stroke-linejoin="round" d="M11.25 11.25l.041-.02a.75.75 0 111.086 1.086L10.5 14.25h3.75a4.5 4.5 0 010 9H8.25m.75-12h-.008v-.008H9v.008z"></path></svg>
              Reboot Board
            </button>
          </div>
        </div>
      </div>

      <!-- Card RFID Scanner -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M15 7a2 2 0 012 2m4 0a6 6 0 01-7.743 5.743L11 17H9v2H7v2H4a1 1 0 01-1-1v-2.586a1 1 0 01.293-.707l5.964-5.964A6 6 0 1121 9z"></path></svg>
          RFID Scanner (MFRC522)
        </h3>
        <div class="status-list">
          <div class="status-item">
            <span class="status-label">Status Koneksi</span>
            <span class="status-value text-green" id="rfid-status-val">
              <span class="status-indicator indicator-green" id="rfid-status-ind"></span>
              Loading...
            </span>
          </div>
          <div class="status-item">
            <span class="status-label">Versi Register PCD</span>
            <span class="status-value mono" id="rfid-version">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">Scan UID Terakhir</span>
            <span class="status-value mono" id="last-rfid" style="color: #6366f1;">Belum ada kartu</span>
          </div>
        </div>
      </div>

      <!-- Card Barcode Scanner -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M3 5v14M7 5v14M11 5v14M15 5v14M17 5v14M21 5v14"></path></svg>
          Barcode Scanner (UART2)
        </h3>
        <div class="status-list">
          <div class="status-item">
            <span class="status-label">Status Koneksi</span>
            <span class="status-value text-green" id="barcode-status-val">
              <span class="status-indicator indicator-green" id="barcode-status-ind"></span>
              ✅ AKTIF
            </span>
          </div>
          <div class="status-item">
            <span class="status-label">Scan Barcode Terakhir</span>
            <span class="status-value mono" id="last-barcode" style="color: #10b981;">Belum ada barcode</span>
          </div>
        </div>
      </div>

      <!-- Card Jaringan WiFi & MQTT -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M3.055 11H5a2 2 0 012 2v1a2 2 0 002 2 2 2 0 012 2v2.945M8 3.935V5.5A2.5 2.5 0 0010.5 8h.5a2 2 0 012 2 2 2 0 002 2h2m-4-3h1.286a2 2 0 00.707-.13l1.581-.79a2 2 0 00.41-.318l1.361-1.36a2 2 0 00.318-.41L21 6.5"></path></svg>
          Koneksi & MQTT Broker
        </h3>
        <div class="status-list">
          <div class="status-item">
            <span class="status-label">Koneksi WiFi</span>
            <span class="status-value text-green" id="wifi-status-val">
              <span class="status-indicator indicator-green" id="wifi-status-ind"></span>
              Loading...
            </span>
          </div>
          <div class="status-item">
            <span class="status-label">SSID WiFi</span>
            <span class="status-value mono" id="wifi-ssid">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">Kekuatan Sinyal</span>
            <span class="status-value mono" id="wifi-rssi">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">Alamat IP Board</span>
            <span class="status-value mono" id="wifi-ip">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">EMQX MQTT Broker</span>
            <span class="status-value text-green" id="mqtt-status-val">
              <span class="status-indicator indicator-green" id="mqtt-status-ind"></span>
              Loading...
            </span>
          </div>
          <div class="status-item">
            <span class="status-label">Alamat Broker</span>
            <span class="status-value mono" id="mqtt-broker">Loading...</span>
          </div>
          <div class="status-item">
            <span class="status-label">MQTT Client ID</span>
            <span class="status-value mono" id="mqtt-client-id">Loading...</span>
          </div>
        </div>
      </div>
    </div>

    <!-- Card Output / Relay & Manual Trigger -->
    <div class="card" style="margin-bottom: 24px;">
      <h3 class="card-title">
        <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M8 11V7a4 4 0 118 0m-4 8v2m-6 4h12a2 2 0 002-2v-6a2 2 0 00-2-2H6a2 2 0 00-2 2v6a2 2 0 002 2z"></path></svg>
        Kontrol Manual Relay Gerbang
      </h3>
      <div class="grid" style="grid-template-columns: 1fr 1fr; margin-bottom: 0;">
        <div class="status-list" style="justify-content: center;">
          <div class="status-item">
            <span class="status-label">Status Gerbang Utama (Relay 1 - GPIO 2)</span>
            <span class="status-value text-muted" id="r1-status">MATI</span>
          </div>
          <div class="status-item">
            <span class="status-label">Status Alarm/Aux (Relay 2 - GPIO 27)</span>
            <span class="status-value text-muted" id="r2-status">MATI</span>
          </div>
        </div>
        <div class="control-row" style="margin-top: 0; display: flex; gap: 10px; justify-content: flex-start; align-items: center; align-content: center; flex-wrap: wrap; width: 100%;">
          <button class="btn" onclick="triggerRelay(1)" style="width: auto; padding: 8px 16px; font-size: 13px;">
            🔓 Buka Gerbang In (R1)
          </button>
          <button class="btn btn-secondary" onclick="triggerRelay(2)" style="width: auto; padding: 8px 16px; font-size: 13px;">
            🔔 Picu Alarm/Aux (R2)
          </button>
        </div>
      </div>
    </div>

    <div class="grid">
      <!-- Card Konfigurasi Target Firmware & Update -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M7 16a4 4 0 01-.88-7.903A5 5 0 1115.9 6L16 6a5 5 0 011 9.9M9 19l3 3m0 0l3-3m-3 3V10"></path></svg>
          GitHub OTA & Target Mesin
        </h3>
        <form id="form-folder">
          <div class="form-group">
            <label>Pilih Target Board (Folder GitHub)</label>
            <select name="folder_name" class="form-control">
              <option value="ESP32main" {{SEL_ESP32MAIN}}>Mesin ESP32 (ESP32main)</option>
              <option value="ESP32_test" {{SEL_ESP32TEST}}>Mesin ESP32 Test (ESP32_test)</option>
              <option value="WT32main" {{SEL_WT32MAIN}}>Mesin WT32 (WT32main)</option>
              <option value="WT32_test" {{SEL_WT32TEST}}>Mesin WT32 Test (WT32_test)</option>
              <option value="src_mainOTA" {{SEL_SRCMAINOTA}}>Main OTA (src_mainOTA)</option>
            </select>
          </div>
          <button type="submit" class="btn" style="margin-bottom: 12px;">Simpan Target & Restart</button>
        </form>
        <button class="btn btn-secondary" onclick="window.location.href='/cek_update'">
          📥 Cek Update GitHub Sekarang
        </button>
      </div>

      <!-- Card Konfigurasi MQTT -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M10.325 4.317c.426-1.756 2.924-1.756 3.35 0a1.724 1.724 0 002.573 1.066c1.543-.94 3.31.826 2.37 2.37a1.724 1.724 0 001.065 2.572c1.756.426 1.756 2.924 0 3.35a1.724 1.724 0 00-1.066 2.573c.94 1.543-.826 3.31-2.37 2.37a1.724 1.724 0 00-2.572 1.065c-.426 1.756-2.924 1.756-3.35 0a1.724 1.724 0 00-2.573-1.066c-1.543.94-3.31-.826-2.37-2.37a1.724 1.724 0 00-1.065-2.572c-1.756-.426-1.756-2.924 0-3.35a1.724 1.724 0 001.066-2.573c-.94-1.543.826-3.31 2.37-2.37.996.608 2.296.07 2.572-1.065z"></path><path stroke-linecap="round" stroke-linejoin="round" d="M15 12a3 3 0 11-6 0 3 3 0 016 0z"></path></svg>
          Pengaturan MQTT Broker
        </h3>
        <form id="form-mqtt">
          <div class="form-group">
            <label>IP Server Broker</label>
            <input type="text" name="mqtt_server" class="form-control" placeholder="192.168.1.50" value="{{MQTT_SERVER}}" required>
          </div>
          <div class="form-group">
            <label>Port Broker</label>
            <input type="number" name="mqtt_port" class="form-control" placeholder="1883" value="{{MQTT_PORT}}" required>
          </div>
          <div class="form-group">
            <label>Username MQTT</label>
            <input type="text" name="mqtt_user" class="form-control" value="{{MQTT_USER}}">
          </div>
          <div class="form-group">
            <label>Password MQTT</label>
            <input type="password" name="mqtt_pass" class="form-control" value="{{MQTT_PASS}}">
          </div>
          <div class="form-group">
            <label>Client ID</label>
            <input type="text" name="mqtt_client_id" class="form-control" value="{{MQTT_CLIENT_ID}}" required>
          </div>
          <button type="submit" class="btn">Simpan MQTT & Restart</button>
        </form>
      </div>

      <!-- Card Konfigurasi Kartu Master -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M15 7a2 2 0 012 2m4 0a6 6 0 01-7.743 5.743L11 17H9v2H7v2H4a1 1 0 01-1-1v-2.586a1 1 0 01.293-.707l5.964-5.964A6 6 0 1121 9z"></path></svg>
          Pengaturan Kartu Master (Bypass)
        </h3>
        <form id="form-master">
          <div class="form-group">
            <label>UID Kartu Master</label>
            <input type="text" name="rfid_master" class="form-control" placeholder="A166C820" value="{{RFID_MASTER}}" required>
          </div>
          <button type="submit" class="btn">Simpan Master & Restart</button>
        </form>
      </div>

      <!-- Card Upload Firmware Manual -->
      <div class="card">
        <h3 class="card-title">
          <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M4 16v1a3 3 0 003 3h10a3 3 0 003-3v-1m-4-8l-4-4m0 0L8 8m4-4v12"></path></svg>
          Upload Firmware Manual (.bin)
        </h3>
        <form id="form-upload">
          <div class="form-group">
            <label>Pilih File Firmware .bin</label>
            <div class="file-input-wrapper">
              <input type="file" name="update" id="file-input" accept=".bin">
              <span class="file-input-text" id="file-name-display">Seret file ke sini atau klik untuk memilih</span>
            </div>
          </div>
          <button type="submit" class="btn">Upload & Flash</button>
        </form>

        <div class="progress-container" id="progress-container">
          <div class="progress-track">
            <div class="progress-bar" id="progress-bar"></div>
          </div>
          <div class="progress-info">
            <span id="progress-status">Menyiapkan...</span>
            <span id="progress-percent">0%</span>
          </div>
        </div>
      </div>
    </div>
  </div>

  <!-- Loading Overlay -->
  <div class="overlay" id="overlay">
    <div class="spinner"></div>
    <h2 id="overlay-title">Memproses...</h2>
    <p id="overlay-subtitle">Menghubungi board ESP32 kembali dalam <span id="overlay-countdown">--</span></p>
  </div>

  <!-- Toast -->
  <div class="toast" id="toast">Gerbang Terbuka!</div>

  <script>
    function updateUI(data) {
      document.getElementById('version-text').innerText = data.version;
      document.getElementById('folder-badge').innerText = data.folder;
      document.getElementById('free-heap').innerText = data.free_heap.toLocaleString() + ' Bytes';
      document.getElementById('min-free-heap').innerText = data.min_free_heap.toLocaleString() + ' Bytes';

      // Format Uptime
      let uptimeSec = data.uptime;
      let hrs = Math.floor(uptimeSec / 3600);
      let mins = Math.floor((uptimeSec % 3600) / 60);
      let secs = uptimeSec % 60;
      document.getElementById('uptime').innerText = (hrs > 0 ? hrs + 'j ' : '') + mins + 'm ' + secs + 's';

      // RFID Status UI
      let rfidVal = document.getElementById('rfid-status-val');
      let rfidInd = document.getElementById('rfid-status-ind');
      rfidVal.innerText = data.rfid_status;
      if (data.rfid_status.indexOf('✅') !== -1) {
        rfidVal.className = 'status-value text-green';
        rfidInd.className = 'status-indicator indicator-green';
      } else {
        rfidVal.className = 'status-value text-red';
        rfidInd.className = 'status-indicator indicator-red';
      }
      document.getElementById('rfid-version').innerText = data.rfid_version;
      document.getElementById('last-rfid').innerText = data.last_rfid || 'Belum ada kartu';
      document.getElementById('last-barcode').innerText = data.last_barcode || 'Belum ada barcode';

      // WiFi UI
      let wifiVal = document.getElementById('wifi-status-val');
      let wifiInd = document.getElementById('wifi-status-ind');
      let wifiCon = (data.wifi_status === 'Connected');
      wifiVal.innerText = wifiCon ? '✅ Terhubung' : '❌ Terputus';
      if (wifiCon) {
        wifiVal.className = 'status-value text-green';
        wifiInd.className = 'status-indicator indicator-green';
      } else {
        wifiVal.className = 'status-value text-red';
        wifiInd.className = 'status-indicator indicator-red';
      }
      document.getElementById('wifi-ssid').innerText = data.wifi_ssid || '-';
      document.getElementById('wifi-rssi').innerText = data.wifi_rssi ? data.wifi_rssi + ' dBm' : '-';
      document.getElementById('wifi-ip').innerText = data.wifi_ip;

      // MQTT UI
      let mqttVal = document.getElementById('mqtt-status-val');
      let mqttInd = document.getElementById('mqtt-status-ind');
      let mqttCon = (data.mqtt_status === 'Connected');
      mqttVal.innerText = mqttCon ? '✅ Terhubung' : '⚠️ Offline';
      if (mqttCon) {
        mqttVal.className = 'status-value text-green';
        mqttInd.className = 'status-indicator indicator-green';
      } else {
        mqttVal.className = 'status-value text-orange';
        mqttInd.className = 'status-indicator indicator-orange';
      }
      document.getElementById('mqtt-broker').innerText = data.mqtt_broker + ':' + data.mqtt_port;
      document.getElementById('mqtt-client-id').innerText = data.mqtt_client_id;

      // Relays UI
      let r1 = document.getElementById('r1-status');
      r1.innerText = data.relay1 ? '✅ AKTIF (Terbuka)' : '🔒 MATI (Tertutup)';
      r1.className = data.relay1 ? 'status-value text-green' : 'status-value text-muted';

      let r2 = document.getElementById('r2-status');
      r2.innerText = data.relay2 ? '🔔 AKTIF (Buka)' : '🔒 MATI (Tutup)';
      r2.className = data.relay2 ? 'status-value text-orange' : 'status-value text-muted';
    }

    function fetchStatus() {
      fetch('/status_data?t=' + Date.now())
        .then(res => res.json())
        .then(data => updateUI(data))
        .catch(err => console.error('Error fetching status data:', err));
    }

    setInterval(fetchStatus, 1500);
    fetchStatus();

    function showToast(message, isSuccess = true) {
      let toast = document.getElementById('toast');
      toast.innerText = message;
      toast.style.borderColor = isSuccess ? 'var(--success)' : 'var(--danger)';
      toast.className = 'toast show';
      setTimeout(() => { toast.className = 'toast'; }, 3000);
    }

    function showOverlay(title, subtitle, seconds) {
      let overlay = document.getElementById('overlay');
      let titleEl = document.getElementById('overlay-title');
      let subtitleEl = document.getElementById('overlay-subtitle');
      let countdown = document.getElementById('overlay-countdown');

      titleEl.innerText = title;
      subtitleEl.innerHTML = subtitle + ' kembali dalam <span id="overlay-countdown"></span>';
      
      overlay.style.display = 'flex';
      let rem = seconds;
      
      let el = document.getElementById('overlay-countdown');
      el.innerText = rem + ' detik...';

      let iv = setInterval(() => {
        rem--;
        if (rem <= 0) {
          clearInterval(iv);
          window.location.href = '/';
        } else {
          el.innerText = rem + ' detik...';
        }
      }, 1000);
    }

    function triggerRelay(num) {
      fetch('/trigger_relay?relay=' + num + '&t=' + Date.now())
        .then(res => {
          if (res.ok) {
            showToast('Relay ' + num + ' Berhasil Dipicu!');
            fetchStatus();
          } else {
            showToast('Gagal memicu relay', false);
          }
        })
        .catch(() => showToast('Error komunikasi', false));
    }

